In [6]:
import pandas as pd

In [7]:
import numpy as np

In [8]:
data =np.random.rand(4,3)

In [9]:
data

array([[0.10549145, 0.57429265, 0.26849982],
       [0.83475804, 0.66613212, 0.31841681],
       [0.29613812, 0.25028651, 0.38840984],
       [0.36579024, 0.48143449, 0.69834857]])

In [10]:
 dataFrame = pd.DataFrame(data)

In [11]:
dataFrame

          0         1         2
0  0.105491  0.574293  0.268500
1  0.834758  0.666132  0.318417
2  0.296138  0.250287  0.388410
3  0.365790  0.481434  0.698349

In [12]:
yeniDataFrame = pd.DataFrame(data,index=["Baran","Öner","Arda","Çolak"],columns = ["Maas","Yas","Calısma Saati"])

In [13]:
yeniDataFrame

           Maas       Yas  Calısma Saati
Baran  0.105491  0.574293       0.268500
Öner   0.834758  0.666132       0.318417
Arda   0.296138  0.250287       0.388410
Çolak  0.365790  0.481434       0.698349

In [14]:
yeniDataFrame["Maas"]

Baran    0.105491
Öner     0.834758
Arda     0.296138
Çolak    0.365790
Name: Maas, dtype: float64

In [15]:
yeniDataFrame[["Maas","Yas"]]

           Maas       Yas
Baran  0.105491  0.574293
Öner   0.834758  0.666132
Arda   0.296138  0.250287
Çolak  0.365790  0.481434

In [16]:
yeniDataFrame.loc["Baran"]

Maas             0.105491
Yas              0.574293
Calısma Saati    0.268500
Name: Baran, dtype: float64

In [17]:
yeniDataFrame.iloc[1]

Maas             0.834758
Yas              0.666132
Calısma Saati    0.318417
Name: Öner, dtype: float64

In [18]:
yeniDataFrame["Emeklilik Yasi"]= yeniDataFrame["Yas"] + yeniDataFrame['Yas']

In [19]:
yeniDataFrame

           Maas       Yas  Calısma Saati  Emeklilik Yasi
Baran  0.105491  0.574293       0.268500        1.148585
Öner   0.834758  0.666132       0.318417        1.332264
Arda   0.296138  0.250287       0.388410        0.500573
Çolak  0.365790  0.481434       0.698349        0.962869

In [20]:
yeniDataFrame.drop("Emeklilik Yasi",axis=1)

           Maas       Yas  Calısma Saati
Baran  0.105491  0.574293       0.268500
Öner   0.834758  0.666132       0.318417
Arda   0.296138  0.250287       0.388410
Çolak  0.365790  0.481434       0.698349

In [21]:
yeniDataFrame.drop("Öner",axis=0)

           Maas       Yas  Calısma Saati  Emeklilik Yasi
Baran  0.105491  0.574293       0.268500        1.148585
Arda   0.296138  0.250287       0.388410        0.500573
Çolak  0.365790  0.481434       0.698349        0.962869

In [22]:
yeniDataFrame.drop("Emeklilik Yasi",axis=1,inplace=True)

In [23]:
yeniDataFrame

           Maas       Yas  Calısma Saati
Baran  0.105491  0.574293       0.268500
Öner   0.834758  0.666132       0.318417
Arda   0.296138  0.250287       0.388410
Çolak  0.365790  0.481434       0.698349

In [24]:
yeniDataFrame.loc["Baran","Yas"]

0.5742926489508418

In [25]:
boolean =yeniDataFrame<0

In [26]:
yeniDataFrame[boolean]

       Maas  Yas  Calısma Saati
Baran   NaN  NaN            NaN
Öner    NaN  NaN            NaN
Arda    NaN  NaN            NaN
Çolak   NaN  NaN            NaN

In [27]:
yeniDataFrame[yeniDataFrame<0]

       Maas  Yas  Calısma Saati
Baran   NaN  NaN            NaN
Öner    NaN  NaN            NaN
Arda    NaN  NaN            NaN
Çolak   NaN  NaN            NaN

In [28]:
yeniDataFrame["Yas"]>0

Baran    True
Öner     True
Arda     True
Çolak    True
Name: Yas, dtype: bool

In [29]:
yeniDataFrame[yeniDataFrame["Yas"] > 0.4]

           Maas       Yas  Calısma Saati
Baran  0.105491  0.574293       0.268500
Öner   0.834758  0.666132       0.318417
Çolak  0.365790  0.481434       0.698349

In [30]:
yeniDataFrame.reset_index()

   index      Maas       Yas  Calısma Saati
0  Baran  0.105491  0.574293       0.268500
1   Öner  0.834758  0.666132       0.318417
2   Arda  0.296138  0.250287       0.388410
3  Çolak  0.365790  0.481434       0.698349

In [31]:
yeniIndexListesi = ["Ati","Zey","Baran","Kasım"]

In [32]:
yeniDataFrame["Yeni Index"] = yeniIndexListesi

In [33]:
yeniDataFrame.set_index("Yeni Index",inplace=True)

In [34]:
yeniDataFrame

                Maas       Yas  Calısma Saati
Yeni Index
Ati         0.105491  0.574293       0.268500
Zey         0.834758  0.666132       0.318417
Baran       0.296138  0.250287       0.388410
Kasım       0.365790  0.481434       0.698349

In [35]:
yeniDataFrame.loc["Ati"]

Maas             0.105491
Yas              0.574293
Calısma Saati    0.268500
Name: Ati, dtype: float64

In [36]:
ilkIndexler = ["Simpson","Simpson","Simpson","South Park","South Park","South Park"]

In [37]:
icIndexler =["Homer","Bart","Merge","Cartman","Kenny","Kyle"]

In [38]:
birlesimIndex = list(zip(ilkIndexler,icIndexler))

In [39]:
birlesimIndex

[('Simpson', 'Homer'),
 ('Simpson', 'Bart'),
 ('Simpson', 'Merge'),
 ('South Park', 'Cartman'),
 ('South Park', 'Kenny'),
 ('South Park', 'Kyle')]

In [40]:
birlesimIndex =pd.MultiIndex.from_tuples(birlesimIndex)

In [42]:
birlesimIndex

MultiIndex([(   'Simpson',   'Homer'),
            (   'Simpson',    'Bart'),
            (   'Simpson',   'Merge'),
            ('South Park', 'Cartman'),
            ('South Park',   'Kenny'),
            ('South Park',    'Kyle')],
           )

In [48]:
benimCizgiFilmListem = [[40,"A"],[10,"B"],[30,"C"],[20,"D"],[40,"A"],[10,"B"]]

In [49]:
cizgiFilmNumpyDizisi = np.array(benimCizgiFilmListem)

In [50]:
cizgiFilmDataFrame = pd.DataFrame(cizgiFilmNumpyDizisi,index=birlesimIndex,columns=["Yas","Meslek"])

In [51]:
cizgiFilmDataFrame

                   Yas Meslek
Simpson    Homer    40      A
           Bart     10      B
           Merge    30      C
South Park Cartman  20      D
           Kenny    40      A
           Kyle     10      B

In [55]:
cizgiFilmDataFrame.loc["Simpson"].loc["Homer"]

Yas       40
Meslek     A
Name: Homer, dtype: object

In [57]:
cizgiFilmDataFrame.index.names =["Film Adı","İsim"]

In [58]:
cizgiFilmDataFrame

                   Yas Meslek
Film Adı   İsim
Simpson    Homer    40      A
           Bart     10      B
           Merge    30      C
South Park Cartman  20      D
           Kenny    40      A
           Kyle     10      B